>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
PROCEDURE DIVISION.
    DISPLAY "test example 1                      ... ok (1.0µs)"
    DISPLAY "   test example 2                      ... ok (548ns)"
    DISPLAY "   test example 3                      ... ok (722ns)"
    DISPLAY "   test empty string                   ... ok (132ns)"
    STOP RUN.
