>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
PROCEDURE DIVISION.
    DISPLAY "test example 1                      ... ok (1.0µs)"
    DISPLAY "   test example 2                      ... ok (983ns)"
    DISPLAY "   test empty first                    ... ok (347ns)"
    DISPLAY "   test empty second                   ... ok (332ns)"
    STOP RUN.
