       IDENTIFICATION DIVISION.
       PROGRAM-ID. CAST-STRING-TO-INT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 STR PIC X(4) VALUE '1995'.
       01 NUM PIC 9(4).
       PROCEDURE DIVISION.
           MOVE FUNCTION NUMVAL(STR) TO NUM
           DISPLAY NUM
           STOP RUN.
