       IDENTIFICATION DIVISION.
       PROGRAM-ID. FUN-EXPR-IN-LET.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 X PIC 9 VALUE 6.
       01 RESULT PIC 99.
       PROCEDURE DIVISION.
           COMPUTE RESULT = X * X
           DISPLAY RESULT
           STOP RUN.
