       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEN-STRING.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 STR PIC X(5) VALUE "mochi".
       01 LEN PIC 9 VALUE 0.
       PROCEDURE DIVISION.
           COMPUTE LEN = FUNCTION LENGTH(STR)
           DISPLAY LEN
           STOP RUN.
