       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAP-NESTED-ASSIGN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 OUTER-INNER PIC 9 VALUE 1.
       PROCEDURE DIVISION.
           MOVE 2 TO OUTER-INNER
           DISPLAY OUTER-INNER
           STOP RUN.
