       IDENTIFICATION DIVISION.
       PROGRAM-ID. PARTIAL-APPLICATION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RESULT PIC 99.
       PROCEDURE DIVISION.
           COMPUTE RESULT = 5 + 3
           DISPLAY RESULT
           STOP RUN.
