       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRINT-HELLO.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 MSG PIC X(5) VALUE "hello".
       PROCEDURE DIVISION.
           DISPLAY MSG
           STOP RUN.
