       IDENTIFICATION DIVISION.
       PROGRAM-ID. PURE-FOLD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RESULT PIC 9.
       PROCEDURE DIVISION.
           COMPUTE RESULT = (1 + 2) * 3
           DISPLAY RESULT
           STOP RUN.
