       IDENTIFICATION DIVISION.
       PROGRAM-ID. PURE-GLOBAL-FOLD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 K PIC 9 VALUE 2.
       01 RESULT PIC 9.
       PROCEDURE DIVISION.
           COMPUTE RESULT = 3 + K
           DISPLAY RESULT
           STOP RUN.
