       IDENTIFICATION DIVISION.
       PROGRAM-ID. RECORD-ASSIGN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 N PIC 9 VALUE 0.
       PROCEDURE DIVISION.
           ADD 1 TO N
           DISPLAY N
           STOP RUN.
