       IDENTIFICATION DIVISION.
       PROGRAM-ID. STR-BUILTIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 N PIC 9(3) VALUE 123.
       PROCEDURE DIVISION.
           DISPLAY N
           STOP RUN.
