       IDENTIFICATION DIVISION.
       PROGRAM-ID. VALUES-BUILTIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VALUES OCCURS 3 TIMES PIC 9.
       01 IDX PIC 9.
       PROCEDURE DIVISION.
           MOVE 1 TO VALUES(1)
           MOVE 2 TO VALUES(2)
           MOVE 3 TO VALUES(3)
           PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > 3
               DISPLAY VALUES(IDX) WITH NO ADVANCING
               IF IDX < 3 THEN DISPLAY ' ' WITH NO ADVANCING END-IF
           END-PERFORM
           DISPLAY ''
           STOP RUN.
