       IDENTIFICATION DIVISION.
       PROGRAM-ID. VAR-ASSIGNMENT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 X PIC 9 VALUE 1.
       PROCEDURE DIVISION.
           MOVE 2 TO X
           DISPLAY X
           STOP RUN.
