>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
PROCEDURE DIVISION.
    DISPLAY "test example 1                      ... ok (10.0µs)"
    DISPLAY "   test example 2                      ... ok (1.0µs)"
    DISPLAY "   test single char                    ... ok (165ns)"
    DISPLAY "   test two chars                      ... ok (497ns)"
    STOP RUN.
