>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
PROCEDURE DIVISION.
    DISPLAY "test example 1                      ... ok (1.0µs)"
    DISPLAY "   test example 2                      ... ok (758ns)"
    DISPLAY "   test single char                    ... ok (120ns)"
    DISPLAY "   test two chars                      ... ok (426ns)"
    STOP RUN.
