>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMS OCCURS 4 TIMES PIC 9.
01 TARGET PIC 9.
01 N PIC 9.
01 I PIC 9.
01 J PIC 9.
01 JSTART PIC 9.
01 RESULT OCCURS 2 TIMES PIC 9.
01 TMP0 PIC 9.
01 TMP1 PIC 9.
PROCEDURE DIVISION.
    MOVE 2 TO NUMS(1)
    MOVE 7 TO NUMS(2)
    MOVE 11 TO NUMS(3)
    MOVE 15 TO NUMS(4)
    MOVE 9 TO TARGET
    MOVE 4 TO N
    MOVE -1 TO RESULT(1)
    MOVE -1 TO RESULT(2)
    PERFORM VARYING I FROM 0 BY 1 UNTIL I >= N
    MOVE I TO JSTART
    ADD 1 TO JSTART
    PERFORM VARYING J FROM JSTART BY 1 UNTIL J >= N
        IF NUMS(I + 1) + NUMS(J + 1) = TARGET
            MOVE I TO RESULT(1)
            MOVE J TO RESULT(2)
            MOVE N TO I
            MOVE N TO J
        END-IF
    END-PERFORM
END-PERFORM
    COMPUTE TMP0 = RESULT(0 + 1)
    DISPLAY TMP0
    COMPUTE TMP1 = RESULT(1 + 1)
    DISPLAY TMP1
    STOP RUN.
